%% 例題6.3（ブロック処理）
% 村松正吾　「多次元信号・画像処理の基礎と展開」
% 
% 動作確認： MATLAB R2026a
X= [
    5.0000    5.0000    7.0000    6.0000    7.0000    2.0000
    6.0000    2.0000    3.0000    2.0000    7.0000    2.0000
    2.0000    2.0000    4.0000    4.0000    4.0000    6.0000
    4.0000    4.0000    4.0000    4.0000    1.0000    2.0000
  ]
C = dctmtx(2)

Y = blockproc(X,[2 2],@(X) C*X.data*C.')


msip.arr2tex(Y,"%.1f")



R = blockproc(Y,[2 2],@(Y) C.'*Y.data*C)

msip.arr2tex(R,"%.0f")

%%
%A1 = rand(2)
%X  = rand(2)
%A2 = rand(2)

%Y = A1*X*A2

%norm(Y(:)-kron(A2.',A1)*X(:))